#include <iostream>
#include <Windows.h>
#define clear system("cls")
#define Pause Sleep(3000)
using namespace std;
int points;
int choise;
int hard;
int main();
void Game();
void Game2();
int PravOtvet(int answer, int PravOtvet, int points) {
	if (PravOtvet == answer)
	{
		clear;
		cout << "[+]Молодец!\n";
		Sleep(1500);
		clear;
		return ++points;
	}
	else {
		clear;
		cout << "[+]Неверно!\n";
		Sleep(1500);
		clear;
		if (points <= 0) {
			return points;
		}
		return --points;

	}
}


void Game() {
	int answer = 0;
	int points = 0;
	int fifty = 5;
	setlocale(0, "");

	clear;
	cout << " Вопрос №1 | 2 + 2=? \t\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1] 12 \t [2] 4 \t [3] 8 \t [4] 3\n";
	cout << "[+] Выберите ответ: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0) {
		fifty--;
		cout << " Вопрос №1 | 2 + 2= \t\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1] \t [2] 4 \t [3]  \t [4] 3\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << " Вопрос №1 | 2 + 2= \t\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1] 12 \t [2] 4 \t [3] 8 \t [4] 3\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №2 | Сколько океанов в мире?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1] 5 \t [2] 3 \t [3] 4 \t [4] 7\n";
	cout << "Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №2 |Сколько океанов в мире?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]5 \t [2] \t [3] 4 \t [4] \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №2 |Сколько океанов в мире?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1] 5 \t [2] 3 \t [3] 4 \t [4] 7\n";
		cout << "Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №3 |В каком году распался ссср?\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n" "Нажмите[5]чтобы использовать 50|50 \n\n";
	cout << " [1]1991\n [2]1993  \n [3] 1994 \n [4] 1992 \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №3 |В каком году распался ссср?\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]1991\n [2]  \n [3]  \n [4] 1993 \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №3 |В каком году распался ссср?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n" "Нажмите[5]чтобы использовать 50|50\n\n" "\n";
		cout << " [1] 1991 \n [2]1993  \n [3] 1994 \n [4] 1992 \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №4 | Что являеься нацтональным животным в Шотландии? \t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1] Единорог \t [2] Лошадь \t [3] Собака \t [4] Черепаха \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №4 | Что являеься нацтональным животным в Шотландии?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1] Единорог \t [2] Лошадь \t [3]  \t [4] 	\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №4 | Что являеься нацтональным животным в Шотландии?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1] Единорог \t [2] Лошадь \t [3] Собака \t [4] Черепаха \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №5 |Какая страна производит больше всего кофе в мире?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1] Мексика \t [2]Бразилия \t [3] Вьетнам  \t [4] Индонезия \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №5 |Какая страна производит больше всего кофе в мире?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]  \t [2] Бразилия \t [3] Вьетнам \t [4]  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №5 |Какая страна производит больше всего кофе в мире?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1] Мексика \t [2]Бразилия \t [3]Вьетнам  \t [4] Индонезия \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №6 |Какой первый безолкагольный напиток привезли в космос?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1]Кола\n [2]Фанта \n [3]Пепси\n [4]Спрайт\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №6 | Какой первый безолкагольный напиток привезли в космос?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]Кола\n [2]  \n [3] \n [4]Спрайт\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №6 |Какой первый безолкагольный напиток привезли в космос?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1]Кола\n [2]Фанта \n [3]Пепси\n [4]Спрайт\n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №7 |Из чего был построенсамый крепкий дом в трех паросятах ?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << " [1]Кирпич \n [2]Салома \n [3]Дерево \n [4]Вата\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №7 |Из чего был построенсамый крепкий дом в трех паросятах ?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << " [1]Кирпич \n [2]Салома \n [3]  \n [4]\n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №7 |Из чего был построенсамый крепкий дом в трех паросятах ?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << " [1]Кирпич \n [2]Салома \n [3]Дерево \n [4]Вата\n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №8 |Как называется маленькая пластиковая штучка на конце шнурков ?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1]Аглет \n [2]Чупок \n [3]Кружево \n [4]Ороко\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №8 |Как называется маленькая пластиковая штучка на конце шнурков ?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1]Аглет \n [2] \n [3]  \n [4]Орочимару убил  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №8 |Как называется маленькая пластиковая штучка на конце шнурков ?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1]Аглет \n [2]Чупок \n [3]Кружево \n [4]Ороко\n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №9 |Сколько длится мгновенье?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1]100 \n [2]90 \n [3]80 \n [4]70 \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << "Вопрос №9 |Сколько длится мгновенье?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1]100  \n [2] 90 \n [3] \n [4]  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << "Вопрос №9 |Сколько длится мгновенье?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1]100 \n [2]90 \n [3]80 \n [4]70 \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 2, points);

	clear;
	cout << " Вопрос №10 |За какую странуиграл Бекхем?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
	cout << "[1]Англия \n [2]Бразилия \n [3]Америка \n [4]Винисуела \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	clear;
	if (answer == 5 && fifty > 0)
	{
		fifty--;
		cout << " Вопрос №10 |За какую странуиграл Бекхем?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\n";
		cout << "[1]Англия  \n [2 \n [3]Америка  \n [4]  \n";
		cout << "[+] Выберите ответ: ";
		cin >> answer;
	}
	else if (fifty <= 0 && answer == 5) {
		cout << "нет подсказок";
		Pause;
		clear;
		cout << " Вопрос №10 |За какую странуиграл Бекхем?\t\t" << "Ваши очки: " << points << "\t" << "Ваши подсказки: " << fifty << "\t" "Нажмите[5]чтобы использовать 50|50" "\n";
		cout << "[1]Англия \n [2]Брозилия \n [3]Америка \n [4]Винисуела \n";
		cout << "[+] Выберите вариант ответа: ";
		cin >> answer;
	}
	points = PravOtvet(answer, 1, points);
	clear;
	cout << "Ваши итоговые очки: " << points << endl << endl;;

	cout << "[1]В меню\n ";
	cout << "[2]Сложный уровень\n ";
	cin >> answer;
	if (answer == 1)
		main();
	else
		cout << "[1]В меню\n ";
	cout << "[2]Сложный уровень\n ";
	if (answer == 2)
		Game2();
	else
		clear;
}
void Game2() {
	int answer = 0;
	int points = 0;
	clear;
	cout << " Вопрос №1 | 2 * 2 =? \n\n";
	cout << "[1] 1 \t [2] 8 \t [3] 2 \t [4] 5\n";
	cout << "[+] Выберите ответ: ";
	cin >> answer;
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №2 | сколько океанов в мире?\n\n";
	cout << " [1]5  \t [2] 4 \t [3] 3 \t [4] 6\n";
	cout << "Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №3 |В каком году распался ссср?\n\n";
	cout << " [1]1991 \n [2]1992  \n [3]1994 \n [4] 1995 \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №4 | Что является национальным животным в Шотландии?\n\n";
	cout << " [1] Единорог \t [2] Лошадь \t [3] Собака \t [4] Черепаха \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №5 |Какая страна производить больше всего кофя в мире?\n\n";
	cout << " [1] Мексика \t [2]Бразилия \t [3]Вьетнам  \t [4]Индонезия\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 2, points);

	clear;
	cout << "Вопрос №6 |Какой первый безалкогольный напитокпривезли в Космос ?\n\n";
	cout << " [1]Кола\n [2]Фанта \n [3]Пепси\n [4]Спрайт\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №7 |Из чего был сделан самый крепкий дом в трех паросятах?\n\n";
	cout << " [1]Кирпич \n [2]Салома \n [3]Дерево \n [4]Спрайт\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №8 |Как называется маленькая пластиковая штучка на конце шнурков ?\n\n";
	cout << "[1]Аглет \n [2]Чупок \n [3]Кружево \n [4]Ороко\n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Вопрос №9 |Сколько длится мгновенье?\n\n";
	cout << "[1]100 \n [2]90 \n [3] 80 \n [4] 70 \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 2, points);

	clear;
	cout << " Вопрос №10 |За какую страну играл Бекхем?\n\n";
	cout << "[1]Англия \n [2]Бразилия \n [3]Америка \n [4]Винисуела \n";
	cout << "[+] Выберите вариант ответа: ";
	cin >> answer;
	points = PravOtvet(answer, 1, points);

	clear;
	cout << "Ваши итоговые очки: " << points << "\n";
	Sleep(1500);
	clear;
	main();
}
void regulations() {
	clear;
	cout << "Здраствуйте:\n В этой игре определиться ваш ум .\nКритерии оценивания:\n(1-3)-Слабовато \n(4-6)-Фифти-Фифти \n(7-9)-Неплохо \n(10)-Замечательно";
	cout << "\nВернуться назад [1]\n ";
	int back;
	cin >> back;
	if (back == 1) {
		clear;
		main();
	}
	else {
		clear;
		cout << "Выбран неправаильный ответ ";
	}
}
int main() {
	int answer = 0;
	setlocale(0, "");
	clear;
	cout << "Добро пожаловать ";
	if (hard == 1) {
		cout << "\t\tУровень сложности:" << "Легкий" << endl;
	}
	else if (hard == 2) {
		cout << "\t\tУровень сложности:" << "Сложный" << endl;

	}
	else {
		cout << "\t\tУровень сложности:" << endl;
	}
	cout << "[1] Начать игру\n";
	cout << "[2] Настройки\n";
	cout << "[3] Правила\n";
	cout << "[0] Выйти\n";
	int menu;
	cin >> menu;

	if (menu == 1 && hard == 1) {
		Game();
	}
	else if (menu == 1 && hard == 2) {

		Game2();

	}
	else if (menu == 2) {
		clear;
		cout << "[+]Выберите уровень сложности\n\n";
		cout << "[1]Легкий\n";
		cout << "[2]Сложный\n";
		choise = 0;
		cin >> choise;
		if (choise == 1) {
			hard = 1;
			clear;
			main();
		}
		else if (choise == 2) {
			hard = 2;
			clear;
			main();
		}
	}
	if (menu == 3) {
		regulations();
	}
}
